Tutorials-4.1/gasMixture/gasDiffusion/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues 
(
    volScalarFieldValue H2 0
    volScalarFieldValue H  1
);

regions
(
    boxToCell
    {
        box ( -0.012 -0.012 -1 ) ( 0 0.012  1 );
        fieldValues
        (
            volScalarFieldValue H2 1
            volScalarFieldValue H  0
        ); 
    } 
);


// ************************************************************************* //
